cvwt-upload-to-github/cfd/stage1/case/0/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    "(inlet|outlet|outletFilter|top|sides)" { type calculated; value uniform 0; }
    deck         { type calculated; value uniform 0; }
    cvwtWalls    { type nutkWallFunction; value uniform 0; }
}
