cvwt-upload-to-github/cfd/stage1/case/constant/coordinateSystems
/*  CVWT stage-1 | OpenFOAM.org 12 (foamRun -solver incompressibleFluid) | generated template  */
FoamFile
{
    format      ascii;
    class       dictionary;
    object      coordinateSystems;
}

filterAxes
{
    type    cartesian;
    origin  (0 0 0);
    coordinateRotation { type axesRotation; e1 (1 0 0); e2 (0 1 0); }
}
