cvwt-upload-to-github/cfd/stage1/case/constant/momentumTransport
/*  CVWT stage-1 | OpenFOAM.org 12 (foamRun -solver incompressibleFluid) | generated template  */
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType RAS;
RAS { model kOmegaSST; turbulence on; printCoeffs on; }
