cvwt-upload-to-github/cfd/stage1/case/system/caseParams
/*  CVWT stage-1 | OpenFOAM.org 12 (foamRun -solver incompressibleFluid) | generated template  */
FoamFile
{
    format      ascii;
    class       dictionary;
    object      caseParams;
}

// All sweep variables live here; make_sweep.py writes one copy per case.  Units SI, rig scale 1:12.
U_IN        @@U_IN@@;          // approach speed at the CVWT [m/s]
K_IN        @@K_IN@@;          // 1.5 (U I)^2, I = 5 % (ASSUMED)
OMEGA_IN    @@OMEGA_IN@@;      // sqrt(k)/(Cmu^0.25 l), l = 0.01 m (ASSUMED)
D_COEFF     @@D_COEFF@@;       // Darcy d [1/m2]  (Ergun, candidate @@FILTER_ID@@)
F_COEFF     @@F_COEFF@@;       // Forchheimer f [1/m]
FILTER_Z0   @@FILTER_Z0@@;     // porous bed bottom [m]  (top fixed at 0.045 m)
FILTER_Z1   0.045;
LVL         @@LVL@@;           // surface refinement level near CVWT core (medium = 5 -> 0.625 mm)
LVL_1       @@LVL_1@@;
LVL_2       @@LVL_2@@;
LVL_3       @@LVL_3@@;
