cvwt-upload-to-github/cfd/stage1/case/system/topoSetDict
/*  CVWT stage-1 | OpenFOAM.org 12 (foamRun -solver incompressibleFluid) | generated template  */
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

#include "caseParams"
actions
(
    // porous biochar bed = fluid cells inside the housing bore between FILTER_Z0 and FILTER_Z1
    { name filterCells; type cellSet; action new; source cylinderToCell;
      point1 (0 0 $FILTER_Z0); point2 (0 0 $FILTER_Z1); radius 0.0172; }
    { name filter; type cellZoneSet; action new; source setToCellZone; set filterCells; }

);
